In [1]:
import pandas as pd

In [2]:
import numpy as np

In [21]:
data=pd.read_csv("karatay_atiksu.csv")

In [22]:
data=data.drop("_id",axis=1)
data.head()

                 tarih   deger birim
0  2004-12-31T00:00:00   0.000   Ton
1  2005-12-31T00:00:00  46.585   Ton
2  2006-12-31T00:00:00  86.853   Ton
3  2007-12-31T00:00:00  87.833   Ton
4  2008-12-31T00:00:00  88.355   Ton

In [23]:
data.drop(columns=["birim"], inplace=True)

In [24]:
data.rename(columns={"deger": "deger=ton"}, inplace=True)
data.head()

                 tarih  deger=ton
0  2004-12-31T00:00:00      0.000
1  2005-12-31T00:00:00     46.585
2  2006-12-31T00:00:00     86.853
3  2007-12-31T00:00:00     87.833
4  2008-12-31T00:00:00     88.355

In [30]:
data["deger=ton"] = data["deger=ton"].apply(lambda x: int(float(x) * 1000))
data.head()

        tarih  deger=ton
0  2004-12-31          0
1  2005-12-31   46585000
2  2006-12-31   86852000
3  2007-12-31   87833000
4  2008-12-31   88355000

In [31]:
data.to_csv("d√ºzenlenmis_karatay_atiksu.csv", index=False)